config/Catalogs/ДоговорыПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыПоставки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Поставщики</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦентрализованныйКонтракт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодДействияПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоступленияТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПоступленияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>uuid_mdm</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляОбратнойРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтсрочкиПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПлатежаДляПолученияБонусов_дней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаЗаДосрочноеПогашение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаРасчетаБонусовСНДСбезНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПлатежаДляПолученияБонусовБАДДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПодачиПретензий</Name>
					<Comment>количество дней, в течении которых может быть выставлена претензия по факту обнаружения расхождений в процессе оприходования товаров</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРабочихДнях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Catalogs/СвязкиТовараСПоставщиком.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СвязкиТовараСПоставщиком</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварФирмы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АССОРТИМЕНТНЫЙ_ПЛАН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Блокировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТовараПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/CommonModules/ОМ_Справочники/Ext/Module.bsl
Функция ПолучитьДоговорПоставщика(Фирма,Поставщик,ДатаНакладнойПоставщика) Экспорт
	
	ОтборФирмы = Новый Структура("Фирма");
	ОтборФирмы.Вставить("Фирма",Фирма);
	Выборка = Справочники.ДоговорыПоставки.Выбрать(,Поставщик,ОтборФирмы);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ПериодДействияПо = Дата(1,1,1) Тогда
			ПериодДействияПо = Дата(2030,1,1);
		Иначе
			ПериодДействияПо = Выборка.ПериодДействияПо;
		КонецЕсли;
		
		Если ДатаНакладнойПоставщика >= Выборка.ПериодДействияС и ДатаНакладнойПоставщика <= ПериодДействияПо Тогда
			Возврат Выборка.Ссылка;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Справочники.ДоговорыПоставки.ПустаяСсылка();
			
КонецФункции

Функция ПолучитьДоговорПоставщикаБезДаты(Фирма,Поставщик) Экспорт
	
	ОтборФирмы = Новый Структура("Фирма");
	ОтборФирмы.Вставить("Фирма",Фирма);
	Выборка = Справочники.ДоговорыПоставки.Выбрать(,Поставщик,ОтборФирмы);
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;	
	КонецЦикла;
	
	Возврат Справочники.ДоговорыПоставки.ПустаяСсылка();
			
КонецФункции

Функция ПолучитьСтрану(Страна) Экспорт
	
	
	Если ПустаяСтрока(Страна) Тогда
	    Возврат Справочники.Страны.ПустаяСсылка();
	Иначе
		НашлиСтрану = Справочники.Страны.НайтиПоНаименованию(Страна,Истина);
		Если НашлиСтрану.Пустая() Тогда
			НоваяСтрана = Справочники.Страны.СоздатьЭлемент();
			НоваяСтрана.Наименование = Страна;
			НоваяСтрана.Записать();
			Возврат НоваяСтрана.Ссылка;
		Иначе
			Возврат НашлиСтрану;
		КонецЕсли;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьБарКод(БарКодСтрока,ЕИТ)  Экспорт
	
			
	Если (СтрДлина(БарКодСтрока)=13) или (СтрДлина(БарКодСтрока)=8) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	ШК.Ссылка как ШКСсылка
		|ИЗ
		|	Справочник.ШКПТ КАК ШК
		|ГДЕ
		|	ШК.Наименование = &Наименование
		|	И ШК.Владелец = &НайденныйТовар";
		Запрос = Новый  Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Наименование",БарКодСтрока);
		Запрос.УстановитьПараметр("НайденныйТовар",ЕИТ);
		
		Рез=Запрос.Выполнить();
		
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ШКСсылка = Выборка.ШКСсылка;
		Иначе
			СпрШК = Справочники.ШКПТ.СоздатьЭлемент();
			СпрШК.Владелец = ЕИТ;
			СпрШК.Наименование = БарКодСтрока;
			СпрШК.Записать();
			ШКСсылка = СпрШК.Ссылка;
		КонецЕсли;	
	Иначе
		ТХТ = "ВЫБРАТЬ
		      |	ШКПТ.Ссылка КАК ШКСсылка
		      |ИЗ
		      |	Справочник.ШКПТ КАК ШКПТ
		      |ГДЕ
		      |	ШКПТ.ПометкаУдаления = ЛОЖЬ
		      |	И ШКПТ.Владелец = &ЕИТ
		      |	И ШКПТ.Наименование <> &Пустой";
		Запрос = Новый Запрос;
		Запрос.Текст = ТХТ;
		Запрос.УстановитьПараметр("ЕИТ",ЕИТ);
		Запрос.УстановитьПараметр("Пустой","0000000000000");
		Рез=Запрос.Выполнить();
		
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			ШКСсылка = Выборка.ШКСсылка;
		Иначе

			ШКСсылка = Справочники.ШКПТ.ПустаяСсылка();	
		КонецЕсли;
	КонецЕсли;
		
	Возврат ШКСсылка;		
	
	
КонецФункции

Функция ПолучитьСертификат(Товар,СертификатСтрока)  Экспорт
	
	Если НЕ ПустаяСтрока(СертификатСтрока) Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	Серт.Ссылка как СертСсылка
		|ИЗ
		|	Справочник.Сертификаты КАК Серт
		|ГДЕ
		|	Серт.Наименование = &Наименование
		|	И Серт.Владелец = &НайденныйТовар";
		Запрос = Новый  Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Наименование",СертификатСтрока);
		Запрос.УстановитьПараметр("НайденныйТовар",Товар);
		
		Рез=Запрос.Выполнить();
		
		Если НЕ Рез.Пустой() Тогда
			Выборка = Рез.Выбрать();
			Выборка.Следующий();
			СертСсылка = Выборка.СертСсылка;
		Иначе
			СпрСерт = Справочники.Сертификаты.СоздатьЭлемент();
			СпрСерт.Владелец = Товар;
			СпрСерт.Наименование = СертификатСтрока;
			СпрСерт.Записать();
			СертСсылка = СпрСерт.Ссылка;
			
		КонецЕсли;	
		
		Возврат СертСсылка;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьГТД(ГТДПоставщика,Страна="")  Экспорт
	
	//------------------<Находим ГТД . Если нет, то создаем новый элемент в справочнике>---------
	Если ПустаяСтрока(ГТДПоставщика) Тогда
		ГТДПоставщика = "----------------------------";
	КонецЕсли;
	
	ГТДСсылка	   = Справочники.ГТД.НайтиПоНаименованию(ГТДПоставщика,Истина);
	Если ГТДСсылка.Пустая() Тогда
		ТекГТД = Справочники.ГТД.СоздатьЭлемент();
		ТекГТД.Наименование = ГТДПоставщика;
		ТекГТД.Страна = ОМ_Справочники.ПолучитьСтрану(Страна);
		ТекГТД.Записать();
		ГТДСсылка = ТекГТД.Ссылка;
	КонецЕсли;
	
	Возврат ГТДСсылка;
	
КонецФункции

Функция ПолучитьСерию(Товар,СерияСтрока,СрокГодности) Экспорт
	
	Если ПустаяСтрока(СерияСтрока) Тогда
		СерияСтрока = "*";
	КонецЕсли;
	

	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Серии.Ссылка как СерияСсылка
	|ИЗ
	|	Справочник.Серии КАК Серии
	|ГДЕ
	|	Серии.Наименование = &Наименование
	|	И Серии.СрокГодности = &СрокГодности
	|	И Серии.Владелец = &НайденныйТовар";
	Запрос = Новый  Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Наименование",СерияСтрока);
	Запрос.УстановитьПараметр("НайденныйТовар",Товар);
	Запрос.УстановитьПараметр("СрокГодности",СрокГодности);
	Рез=Запрос.Выполнить();
		
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		Выборка.Следующий();
		СерияСсылка = Выборка.СерияСсылка;
	Иначе
		СпрСер = Справочники.Серии.СоздатьЭлемент();
		СпрСер.Владелец = Товар;
		СпрСер.Наименование = СерияСтрока;
		СпрСер.СрокГодности = СрокГодности;
		СпрСер.Записать();
		СерияСсылка = СпрСер.Ссылка;
	КонецЕсли;
	Возврат СерияСсылка;
	
КонецФункции

Функция ПолучитьТоварПоСвязке(КодТовараПоставщика,Поставщик)  Экспорт
	
	//------------------<Найдем товар из таблицы сопоставления>-------------------Virus----03.02.2008
	
	ТХТ = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	      |	СвязкиТовараСПоставщиком.КодТовараПоставщика КАК КодТовараПоставщика,
	      |	СвязкиТовараСПоставщиком.ТоварФирмы КАК Товар,
	      |	СвязкиТовараСПоставщиком.ТоварФирмы.Код КАК КодТовара,
		  //|	СвязкиТовараСПоставщиком.ТоварФирмы.СтавкаНДС.Ставка как СтавкаНДС,
	      |	ВЫБОР
	      |		КОГДА СвязкиТовараСПоставщиком.ТоварФирмы.СтавкаНДС.Код = 3
	      |				И &Дата < ДАТАВРЕМЯ(2019, 1, 1)
	      |			ТОГДА 18
	      |		ИНАЧЕ СвязкиТовараСПоставщиком.ТоварФирмы.СтавкаНДС.Ставка
	      |	КОНЕЦ КАК СтавкаНДС,
	      |	СвязкиТовараСПоставщиком.ТоварФирмы.ЕдиницаПоУмолчанию КАК ЕдиницаПоУмолчанию,
	      |	СвязкиТовараСПоставщиком.ТоварФирмы.ЕдиницаПоУмолчанию.К КАК Коэфф
	      |ИЗ
	      |	Справочник.СвязкиТовараСПоставщиком КАК СвязкиТовараСПоставщиком
	      |ГДЕ
	      |	СвязкиТовараСПоставщиком.Поставщик = &Поставщик
	      |	И СвязкиТовараСПоставщиком.КодТовараПоставщика = &КодТовараПоставщика";
		  
	Запрос = Новый Запрос;
	Запрос.Текст = ТХТ;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("КодТовараПоставщика",КодТовараПоставщика);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	Выборка.Следующий();
	Возврат Выборка;
	
	
	
КонецФункции
